create_a_new_yocto_layer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Yocto: Create a New Layer</title>
<!-- 2018-11-18 日 16:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="yannik" />
<link rel="stylesheet" type="text/css" href="./style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Yocto: Create a New Layer</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Creat a new layer</a></li>
<li><a href="#sec-2">2. Create sub-dirctories</a></li>
<li><a href="#sec-3">3. Create Kernel Patch</a>
<ul>
<li><a href="#sec-3-1">3.1. Enter into kernel source code dirctory</a></li>
<li><a href="#sec-3-2">3.2. Add a new kernel module</a></li>
<li><a href="#sec-3-3">3.3. Commit the new code</a></li>
<li><a href="#sec-3-4">3.4. Create a patch file</a></li>
<li><a href="#sec-3-5">3.5. Move the patch to our new layer</a></li>
<li><a href="#sec-3-6">3.6. Add configuration fragment</a></li>
<li><a href="#sec-3-7">3.7. Add configuration fragment and patch file into bbappend file</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Reconstruct Kernel</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Creat a new layer</h2>
<div class="outline-text-2" id="text-1">
<p>
To use yocto-layer command to create a new layer: yannik
</p>
<div class="org-src-container">

<pre class="src src-shell">$ yocto-layer create yannik
</pre>
</div>

<p>
A new directory meta-yannik will be created after the command is executed, and add the layer to BBLAYERS in conf/bblayers.conf:
</p>
<div class="org-src-container">

<pre class="src src-shell">$ bitbake-layers add-layer &lt;path-to-new-layer&gt;
</pre>
</div>

<p>
or directly edit bblayers.conf file to add the new layer to BBLAYERS.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Create sub-dirctories</h2>
<div class="outline-text-2" id="text-2">
<p>
To create some necessary sub-directories:
</p>
<div class="org-src-container">

<pre class="src src-shell">$ mkdir -p recipes-kernel/linux
$ mkdir -p recipes-kernel/linux/files
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Create Kernel Patch</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Enter into kernel source code dirctory</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-shell">$ bitbake -c devshell linux-renesas
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Add a new kernel module</h3>
<div class="outline-text-3" id="text-3-2">
<p>
/drivers/misc/testmod.c:
</p>
<div class="org-src-container">

<pre class="src src-c">#include &lt;linux/module.h&gt;

static int __init testmod_init(void)
{
	pr_infoi("%s ...\n", __func__);
}

static void __exit testmod_exit(void)
{
	pr_info("%s ...\n", __func__);
}

module_init(testmod_init);
module_exit(testmod_exit);

MODULE_LICENSE("GPL");
</pre>
</div>

<p>
drivers/misc/Makefile (add to the end of the file):
</p>
<div class="org-src-container">

<pre class="src src-shell">obj-$(CONFIG_TESTMOD_DRIVER)     += testmod.o
</pre>
</div>

<p>
drivers/misk/Kconfig (add to the end of the file):
</p>
<div class="org-src-container">

<pre class="src src-shell">config TESTMOD_DRIVER
	tristate "Yocto Project Test Driver"
	help
	  This driver does nothing but print a message.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Commit the new code</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-shell">$ git status
$ git add .
$ git commit -m "Add the testmod driver"
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Create a patch file</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-shell">$ git format-patch -n HEAD^
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Move the patch to our new layer</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Move the patch file 0001-Add-testmod-driver.patch to recipes-kernel/linux/files in our new layer. 
</p>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Add configuration fragment</h3>
<div class="outline-text-3" id="text-3-6">
<p>
meta-yannik/recipes-kernel/linux/files/testmod.cfg:
</p>
<div class="org-src-container">

<pre class="src src-shell"># Enabel testmode driver
CONFIG_TESTMODE_DRIVER=y
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Add configuration fragment and patch file into bbappend file</h3>
<div class="outline-text-3" id="text-3-7">
<p>
meta-yannik/recipes-kernel/linux/linux-renesas\<sub>4</sub>.14.bbappend:
</p>
<div class="org-src-container">

<pre class="src src-shell">FILESEXTRAPATHS_prepend := "${THISDIR}/files:"

SRC_URI += "file://testmod.cfg"
SRC_URI += "file://0001-Add-testmod-driver.patch"
</pre>
</div>

<p>
directory structure:
</p>
<div class="org-src-container">

<pre class="src src-shell">~/work/yocto_linux/meta-yannik ⌚ 15:52:43
⚡ tree
.
├── conf
│   └── layer.conf
├── COPYING.MIT
├── README
└── recipes-kernel
    └── linux
	├── bitbake-cookerdaemon.log
	├── files
	│   ├── 0001-Add-testmod-driver.patch
	│   ├── bitbake-cookerdaemon.log
	│   └── testmod.cfg
	└── linux-renesas_4.14.bbappend

4 directories, 8 files
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Reconstruct Kernel</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-shell">$ bitbake -C fetch linux-renesas
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-11-18 日&gt;</span></span></p>
<p class="author">Author: yannik</p>
<p class="date">Created: 2018-11-18 日 16:02</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
